{
  "competition": {
    "id": 119106,
    "competitionName": "santa-2025",
    "title": "Santa 2025 - Christmas Tree Packing Challenge",
    "briefDescription": "How many Christmas trees can fit in a box? Help solve a classic optimization problem with a festive twist.",
    "dateEnabled": "2025-11-17T18:25:29.117Z",
    "deadline": "2026-01-30T23:59:00Z",
    "hasLeaderboard": true,
    "leaderboardPercentage": 100,
    "maxDailySubmissions": 100,
    "numScoredSubmissions": 1,
    "hasSolution": true,
    "numPrizes": 4,
    "forumId": 9181143,
    "userRankMultiplier": 1,
    "dateCreated": "2025-10-28T19:03:06.840461900Z",
    "competitionHostSegmentId": 1,
    "maxTeamSize": 5,
    "medalsAllowed": true,
    "totalSolutionRows": 20100,
    "teamMergerExplicitDeadline": "2026-01-23T12:59:00Z",
    "prohibitNewEntrantsExplicitDeadline": "2026-01-23T12:59:00Z",
    "organizationId": 4,
    "hasCoverImageUrl": true,
    "hasScripts": true,
    "totalTeams": 2126,
    "totalCompetitors": 2320,
    "totalSubmissions": 34832,
    "rulesRequired": true,
    "clonedFromCompetitionId": 88046,
    "rowIdColumnName": "id",
    "evaluationAlgorithm": {
      "id": 5149,
      "name": "Santa 2025 Metric",
      "environmentRenderType": "ENVIRONMENT_RENDER_TYPE_JSON",
      "kernelId": 97141239,
      "latestCompetitionMetricVersionId": 53379,
      "state": "AVAILABLE"
    },
    "categories": [
      {
        "id": 15002,
        "name": "optimization",
        "fullPath": "technique > optimization",
        "datasetCount": 188,
        "competitionCount": 25,
        "scriptCount": 1457,
        "slug": "optimization",
        "displayName": "Optimization"
      },
      {
        "id": 16278,
        "name": "holidays and cultural events",
        "fullPath": "subject > people and society > people > holidays and cultural events",
        "datasetCount": 1246,
        "competitionCount": 8,
        "scriptCount": 150,
        "slug": "holidays-and-seasonal-events",
        "displayName": "Holidays and Cultural Events"
      },
      {
        "name": "custom metric",
        "description": "This competition's metric is defined under the 'Evaluation' tab",
        "displayName": "Custom Metric"
      }
    ],
    "organization": {
      "slug": "kaggle",
      "name": "Kaggle",
      "thumbnailImageUrl": "https://storage.googleapis.com/kaggle-organizations/4/thumbnail.png",
      "profileUrl": "/organizations/kaggle"
    },
    "launched": true,
    "createdByUserId": 8939556,
    "license": {
      "id": 42,
      "name": "Subject to Competition Rules",
      "agreementRequired": false
    },
    "hostName": "Kaggle",
    "scoreTruncationNumDecimals": 12,
    "totalJoinedUsers": 8219,
    "requiresIdentityVerification": true,
    "submissionSizeLimitMb": 20480,
    "reward": {
      "id": "USD",
      "quantity": 50000
    }
  },
  "pages": {
    "pages": [
      {
        "id": 566002,
        "competitionId": 119106,
        "name": "rules",
        "content": "##ENTRY IN THIS COMPETITION CONSTITUTES YOUR ACCEPTANCE OF THESE OFFICIAL COMPETITION RULES.\n\n**[See Section 3.18 for defined terms](https://www.kaggle.com/competitions/santa-2025/rules#18.-definitions)**\n\n*The Competition named below is a skills-based competition to promote and further the field of data science. You must register via the Competition Website to enter. To enter the Competition, you must agree to these Official Competition Rules, which incorporate by reference the provisions and content of the Competition Website and any Specific Competition Rules herein (collectively, the \"Rules\"). Please read these Rules carefully before entry to ensure you understand and agree. You further agree that Submission in the Competition constitutes agreement to these Rules. You may not submit to the Competition and are not eligible to receive the prizes associated with this Competition unless you agree to these Rules. These Rules form a binding legal agreement between you and the Competition Sponsor with respect to the Competition. Your competition Submissions  must conform to the requirements stated on the Competition Website. Your Submissions will be scored based on the evaluation metric described on the Competition Website. Subject to compliance with the Competition Rules, Prizes, if any, will be awarded to Participants with the best scores, based on the merits of the data science models submitted. See below for the complete Competition Rules.*\n\n**You cannot sign up to Kaggle from multiple accounts and therefore you cannot enter or submit from multiple accounts.**\n\n<h3>1. COMPETITION-SPECIFIC TERMS</h3>\n<h4>1. COMPETITION TITLE</h4> Santa 2025 - Christmas Tree Packing Challenge\n<h4>2. COMPETITION SPONSOR</h4>  Kaggle\n<h4>3. COMPETITION SPONSOR ADDRESS</h4> 1600 Amphitheatre Parkway, Mountain View, CA 94043\n<h4>4. COMPETITION WEBSITE</h4> https://www.kaggle.com/c/santa-2025\n<h4>5. TOTAL PRIZES AVAILABLE: $50,000</h4> \n- First Prize: $12,000\n- Second Prize: $10,000\n- Third Prize: $10,000\n- Fourth Prize: $8,000\n\n**Rudolph Prize** - $10,000: Awarded to the team holding 1st place on the leaderboard for the longest period of time between November 17, 2025 12:00 AM UTC and January 30, 2026 11:59 PM UTC. In the event the competition needs to be restarted, the Rudolph Prize dates shall be the new start and deadline of the competition.\n\n<h4>6. WINNER LICENSE TYPE</h4> Open Source\n<h4>7. DATA ACCESS AND USE</h4> Open Source\n\n\n###2. COMPETITION-SPECIFIC RULES \nIn addition to the provisions of the General Competition Rules below, you understand and agree to these Competition-Specific Rules required by the Competition Sponsor:\n\n####1. TEAM LIMITS\na. The maximum Team size is five (5).</h5>\nb. Team mergers are allowed and can be performed by the Team leader. In order to merge, the combined Team must have a total Submission count less than or equal to the maximum allowed as of the Team Merger Deadline. The maximum allowed is the number of Submissions per day multiplied by the number of days the competition has been running.</h5>\n\n####2. SUBMISSION LIMITS\na. You may submit a maximum of 100 entries per day.</h5>\nb. You may select up to two (2) Final Submissions for judging.</h5>\n\n####3. COMPETITION TIMELINE\na. Competition Timeline dates (including Entry Deadline, Final Submission Deadline, Start Date, and Team Merger Deadline, as applicable) are reflected on the competition’s Overview > Timeline page.</h5>\n\n####4. COMPETITION DATA\n\na. Data Access and Use.</h5>\n\n1. You may access and use the Competition Data for any purpose, whether commercial or non-commercial, including for participating in the Competition and on Kaggle.com forums, and for academic research and education. The Competition Sponsor reserves the right to disqualify any Participant who uses the Competition Data other than as permitted by the Competition Website and these Rules.</h6>\n\nb. Data Security. </h5>\n\n1. You agree to use reasonable and suitable measures to prevent persons who have not formally agreed to these Rules from gaining access to the Competition Data. You agree not to transmit, duplicate, publish, redistribute or otherwise provide or make available the Competition Data to any party not participating in the Competition. You agree to notify Kaggle immediately upon learning of any possible unauthorized transmission of or unauthorized access to the Competition Data and agree to work with Kaggle to rectify any unauthorized transmission or access.</h6>\n\n####5. WINNER LICENSE \n\na. Under Section 2.8 (Winners Obligations) of the General Rules below, you hereby grant and will grant the Competition Sponsor the following license(s) with respect to your Submission if you are a Competition winner:</h5>\n\n*Open Source*: You hereby license and will license your winning Submission and the source code used to generate the Submission under an Open Source Initiative-approved license (see [www.opensource.org] (http://www.opensource.org)) that in no event limits commercial use of such code or model containing or depending on such code. </h6>\n\nb. You may be required by the Sponsor to provide a detailed description of how the winning Submission was generated, to the Competition Sponsor’s specifications, as outlined in Section 2.8, Winner’s Obligations. This may include a detailed description of methodology, where one must be able to reproduce the approach by reading the description, and includes a detailed explanation of the architecture, preprocessing, loss function, training details, hyper-parameters, etc. The description should also include a link to a code repository with complete and detailed instructions so that the results obtained can be reproduced.</h7>\n \n####6. EXTERNAL DATA AND TOOLS\n\na. You may use data other than the Competition Data (“External Data”) to develop and test your Submissions. However, you will ensure the External Data is either publicly available and equally accessible to use by all Participants of the Competition for purposes of the competition at no cost to the other Participants, or satisfies the Reasonableness criteria as outlined in Section 2.6.b below. The ability to use External Data under this Section does not limit your other obligations under these Competition Rules, including but not limited to Section 2.8 (Winners Obligations). </h5>\n\nb. The use of external data and models is acceptable unless specifically prohibited by the Host. Because of the potential costs or restrictions (e.g., “geo restrictions”) associated with obtaining rights to use external data or certain software and associated tools, their use must be “reasonably accessible to all” and of “minimal cost”. Also, regardless of the cost challenges as they might affect all Participants during the course of the competition, the costs of potentially procuring a license for software used to generate a Submission, must also be considered. The Host will employ an assessment of whether or not the following criteria can exclude the use of the particular LLM, data set(s), or tool(s):</h5>\n\n1. Are Participants being excluded from a competition because of the \"excessive\" costs for access to certain LLMs, external data, or tools that might be used by other Participants. The Host will assess the excessive cost concern by applying a “Reasonableness” standard (the “Reasonableness Standard”). The Reasonableness Standard will be determined and applied by the Host in light of things like cost thresholds and accessibility.</h6>\n\n2. By way of example only, a small subscription charge to use additional elements of a large language model such as Gemini Advanced are acceptable if meeting the Reasonableness Standard of Sec. 8.2. Purchasing a license to use a proprietary dataset that exceeds the cost of a prize in the competition would not be considered reasonable.</h6>\n\nc. Automated Machine Learning Tools (“AMLT”)</h5>\n\n1. Individual Participants and Teams may use automated machine learning tool(s) (“AMLT”) (e.g., Google toML, H2O Driverless AI, etc.) to create a Submission, provided that the Participant or Team ensures that they have an appropriate license to the AMLT such that they are able to comply with the Competition Rules. </h6>\n\n####7. ELIGIBILITY\n\na. Unless otherwise stated in the Competition-Specific Rules above or prohibited by internal policies of the Competition Entities, employees, interns, contractors, officers and directors of Competition Entities may enter and participate in the Competition, but are not eligible to win any Prizes. \"Competition Entities\" means the Competition Sponsor, Kaggle Inc., and their respective parent companies, subsidiaries and affiliates. If you are such a Participant from a Competition Entity, you are subject to all applicable internal policies of your employer with respect to your participation.</h5>\n\n####8. WINNER’S OBLIGATIONS\n\na. As a condition to being awarded a Prize, a Prize winner must fulfill the following obligations:</h5>\n\n1. Deliver to the Competition Sponsor the final model's software code as used to generate the winning Submission and associated documentation. The delivered software code should follow [these documentation guidelines][5], must be capable of generating the winning Submission, and contain a description of resources required to build and/or run the executable code successfully. For avoidance of doubt, delivered software code should include training code, inference code, and a description of the required computational environment. \n\na. To the extent that the final model’s software code includes generally commercially available software that is not owned by you, but that can be procured by the Competition Sponsor without undue expense, then instead of delivering the code for that software to the Competition Sponsor, you must identify that software, method for procuring it, and any parameters or other information necessary to replicate the winning Submission; Individual Participants and Teams who create a Submission using an AMLT may win a Prize. However, for clarity, the potential winner’s Submission must still meet the requirements of these Rules, including but not limited to Section 2.5 (Winners License), Section 2.8 (Winners Obligations), and Section 3.14 (Warranty, Indemnity, and Release).” </h6>\n\nb. Individual Participants and Teams who create a Submission using an AMLT may win a Prize. However, for clarity, the potential winner’s Submission must still meet the requirements of these Rules,</h6>\n\n2. Grant to the Competition Sponsor the license to the winning Submission stated in the Competition Specific Rules above, and represent that you have the unrestricted right to grant that license;</h6>\n\n3. Sign and return all Prize acceptance documents as may be required by Competition Sponsor or Kaggle, including without limitation: (a) eligibility certifications; (b) licenses, releases and other agreements required under the Rules; and (c) U.S. tax forms (such as IRS Form W-9 if U.S. resident, IRS Form W-8BEN if foreign resident, or future equivalents).</h6>\n\n####9. GOVERNING LAW\n\na. Unless otherwise provided in the Competition Specific Rules above, all claims arising out of or relating to these Rules will be governed by California law, excluding its conflict of laws rules, and will be litigated exclusively in the Federal or State courts of Santa Clara County, California, USA. The parties consent to personal jurisdiction in those courts. If any provision of these Rules is held to be invalid or unenforceable, all remaining provisions of the Rules will remain in full force and effect.</h5>\n\n###3. GENERAL COMPETITION RULES - BINDING AGREEMENT\n####1. ELIGIBILITY\na. To be eligible to enter the Competition, you must be:</h5>\n1. a registered account holder at Kaggle.com; </h6>\n2. the older of 18 years old or the age of majority in your jurisdiction of residence (unless otherwise agreed to by Competition Sponsor and appropriate parental/guardian consents have been obtained by Competition Sponsor); </h6>\n3. not a resident of Crimea, so-called Donetsk People's Republic (DNR) or Luhansk People's Republic (LNR), Cuba, Iran, Syria, or North Korea; and</h6>\n4. not a person or representative of an entity under U.S. export controls or sanctions (see: [https://www.treasury.gov/resourcecenter/sanctions/Programs/Pages/Programs.aspx][1]).</h6>\n\nb. Competitions are open to residents of the United States and worldwide, except that if you are a resident of Crimea, so-called Donetsk People's Republic (DNR) or Luhansk People's Republic (LNR), Cuba, Iran, Syria, North Korea, or are subject to U.S. export controls or sanctions, you may not enter the Competition. Other local rules and regulations may apply to you, so please check your local laws to ensure that you are eligible to participate in skills-based competitions. The Competition Host reserves the right to forego or award alternative Prizes where needed to comply with local laws. If a winner is located in a country where prizes cannot be awarded, then they are not eligible to receive a prize.</h5>\n\nc. If you are entering as a representative of a company, educational institution or other legal entity, or on behalf of your employer, these rules are binding on you, individually, and the entity you represent or where you are an employee. If you are acting within the scope of your employment, or as an agent of another party, you warrant that such party or your employer has full knowledge of your actions and has consented thereto, including your potential receipt of a Prize. You further warrant that your actions do not violate your employer's or entity's policies and procedures.</h5>   \n\nd. The Competition Sponsor reserves the right to verify eligibility and to adjudicate on any dispute at any time. If you provide any false information relating to the Competition concerning your identity, residency, mailing address, telephone number, email address, ownership of right, or information required for entering the Competition, you may be immediately disqualified from the Competition.</h5>\n\n####2. SPONSOR AND HOSTING PLATFORM\n\na. The Competition is sponsored by Competition Sponsor named above. The Competition is hosted on behalf of Competition Sponsor by Kaggle Inc. (\"Kaggle\"). Kaggle is an independent contractor of Competition Sponsor, and is not a party to this or any agreement between you and Competition Sponsor. You understand that Kaggle has no responsibility with respect to selecting the potential Competition winner(s) or awarding any Prizes. Kaggle will perform certain administrative functions relating to hosting the Competition, and you agree to abide by the provisions relating to Kaggle under these Rules. As a Kaggle.com account holder and user of the Kaggle competition platform, remember you have accepted and are subject to the Kaggle Terms of Service at [www.kaggle.com/terms][2] in addition to these Rules.</h5>\n\n####3. COMPETITION PERIOD\na. For the purposes of Prizes, the Competition will run from the Start Date and time to the Final Submission Deadline (such duration the “Competition Period”). The Competition Timeline is subject to change, and Competition Sponsor may introduce additional hurdle deadlines during the Competition Period. Any updated or additional deadlines will be publicized on the Competition Website. It is your responsibility to check the Competition Website regularly to stay informed of any deadline changes. YOU ARE RESPONSIBLE FOR DETERMINING THE CORRESPONDING TIME ZONE IN YOUR LOCATION.</h5>\n\n####4. COMPETITION ENTRY\na. NO PURCHASE NECESSARY TO ENTER OR WIN. To enter the Competition, you must register on the Competition Website prior to the Entry Deadline, and follow the instructions for developing and entering your Submission through the Competition Website. Your Submissions must be made in the manner and format, and in compliance with all other requirements, stated on the Competition Website (the \"Requirements\"). Submissions must be received before any Submission deadlines stated on the Competition Website. Submissions not received by the stated deadlines will not be eligible to receive a Prize.</h5>\nb. Submissions may not use or incorporate information from hand labeling or human prediction of the validation dataset or test data records.</h5>\nc. If the Competition is a multi-stage competition with temporally separate training and/or test data, one or more valid Submissions may be required during each Competition stage in the manner described on the Competition Website in order for the Submissions to be Prize eligible.</h5>\nd. Submissions are void if they are in whole or part illegible, incomplete, damaged, altered, counterfeit, obtained through fraud, or late. Competition Sponsor reserves the right to disqualify any entrant who does not follow these Rules, including making a Submission that does not meet the Requirements. </h5>\n\n####5. INDIVIDUALS AND TEAMS\na. Individual Account. You may make Submissions only under one, unique Kaggle.com account. You will be disqualified if you make Submissions through more than one Kaggle account, or attempt to falsify an account to act as your proxy. You may submit up to the maximum number of Submissions per day as specified on the Competition Website. </h5>\nb. Teams. If permitted under the Competition Website guidelines, multiple individuals may collaborate as a Team; however, you may join or form only one Team. Each Team member must be a single individual with a separate Kaggle account. You must register individually for the Competition before joining a Team. You must confirm your Team membership to make it official by responding to the Team notification message sent to your Kaggle account. Team membership may not exceed the Maximum Team Size stated on the Competition Website.</h5>\nc. Team Merger. Teams may request to merge via the Competition Website. Team mergers may be allowed provided that: (i) the combined Team does not exceed the Maximum Team Size; (ii) the number of Submissions made by the merging Teams does not exceed the number of Submissions permissible for one Team at the date of the merger request; (iii) the merger is completed before the earlier of: any merger deadline or the Competition deadline; and (iv) the proposed combined Team otherwise meets all the requirements of these Rules. </h5>\nd. Private Sharing. No private sharing outside of Teams. Privately sharing code or data outside of Teams is not permitted. It's okay to share code if made available to all Participants on the forums.</h5>\n\n####6. SUBMISSION CODE REQUIREMENTS\na. Private Code Sharing. Unless otherwise specifically permitted under the Competition Website or Competition Specific Rules above, during the Competition Period, you are not allowed to privately share source or executable code developed in connection with or based upon the Competition Data or other source or executable code relevant to the Competition (“Competition Code”). This prohibition includes sharing Competition Code between separate Teams, unless a Team merger occurs. Any such sharing of Competition Code is a breach of these Competition Rules and may result in disqualification.</h5>\nb. Public Code Sharing. You are permitted to publicly share Competition Code, provided that such public sharing does not violate the intellectual property rights of any third party. If you do choose to share Competition Code or other such code, you are required to share it on Kaggle.com on the discussion forum or notebooks associated specifically with the Competition for the benefit of all competitors. By so sharing, you are deemed to have licensed the shared code under an Open Source Initiative-approved license (see [www.opensource.org][3]) that in no event limits commercial use of such Competition Code or model containing or depending on such Competition Code.</h5>\nc. Use of Open Source. Unless otherwise stated in the Specific Competition Rules above, if open source code is used in the model to generate the Submission, then you must only use open source code licensed under an Open Source Initiative-approved license (see [www.opensource.org][4]) that in no event limits commercial use of such code or model containing or depending on such code.</h5>\n\n####7. DETERMINING WINNERS\na. Each Submission will be scored and ranked by the evaluation metric stated on the Competition Website. During the Competition Period, the current ranking will be visible on the Competition Website's Public Leaderboard. The potential winner(s) are determined solely by the leaderboard ranking on the Private Leaderboard, subject to compliance with these Rules. The Public Leaderboard will be based on the public test set and the Private Leaderboard will be based on the private test set.</h5>\nb. In the event of a tie, the Submission that was entered first to the Competition will be the winner. In the event a potential winner is disqualified for any reason, the Submission that received the next highest score rank will be chosen as the potential winner.</h5>\n\n####8. NOTIFICATION OF WINNERS & DISQUALIFICATION\na. The potential winner(s) will be notified by email.</h5> \nb. If a potential winner (i) does not respond to the notification attempt within one (1) week from the first notification attempt or (ii) notifies Kaggle within one week after the Final Submission Deadline that the potential winner does not want to be nominated as a winner or does not want to receive a Prize, then, in each case (i) and (ii) such potential winner will not receive any Prize, and an alternate potential winner will be selected from among all eligible entries received based on the Competition’s judging criteria.</h5>\nc. In case (i) and (ii) above Kaggle may disqualify the Participant.  However, in case (ii) above, if requested by Kaggle, such potential winner may provide code and documentation to verify the Participant’s compliance with these Rules. If the potential winner provides code and documentation to the satisfaction of Kaggle, the Participant will not be disqualified pursuant to this paragraph.</h5>\nd. Competition Sponsor reserves the right to disqualify any Participant from the Competition if the Competition Sponsor reasonably believes that the Participant has attempted to undermine the legitimate operation of the Competition by cheating, deception, or other unfair playing practices or abuses, threatens or harasses any other Participants, Competition Sponsor or Kaggle.</h5>\ne. A disqualified Participant may be removed from the Competition leaderboard, at Kaggle's sole discretion. If a Participant is removed from the Competition Leaderboard, additional winning features associated with the Kaggle competition platform, for example Kaggle points or medals, may also not be awarded.</h5>\nf. The final leaderboard list will be publicly displayed at Kaggle.com. Determinations of Competition Sponsor are final and binding.</h5>\n\n####9. PRIZES\na. Prize(s) are as described on the Competition Website and are only available for winning during the time period described on the Competition Website. The odds of winning any Prize depends on the number of eligible Submissions received during the Competition Period and the skill of the Participants. </h5>\nb. All Prizes are subject to Competition Sponsor's review and verification of the Participant’s eligibility and compliance with these Rules, and the compliance of the winning Submissions with the Submissions Requirements. In the event that the Submission demonstrates non-compliance with these Competition Rules, Competition Sponsor may at its discretion take either of the following actions: (i) disqualify the Submission(s); or (ii) require the potential winner to remediate within one week after notice all issues identified in the Submission(s) (including, without limitation, the resolution of license conflicts, the fulfillment of all obligations required by software licenses, and the removal of any software that violates the software restrictions).</h5>\nc. A potential winner may decline to be nominated as a Competition winner in accordance with Section 3.8.</h5>\nd. Potential winners must return all required Prize acceptance documents within two (2) weeks following notification of such required documents, or such potential winner will be deemed to have forfeited the prize and another potential winner will be selected. Prize(s) will be awarded within approximately thirty (30) days after receipt by Competition Sponsor or Kaggle of the required Prize acceptance documents. Transfer or assignment of a Prize is not allowed. </h5>\ne. You are not eligible to receive any Prize if you do not meet the Eligibility requirements in Section 2.7 and Section 3.1 above.</h5>\nf. If a Team wins a monetary Prize, the Prize money will be allocated in even shares between the eligible Team members, unless the Team unanimously opts for a different Prize split and notifies Kaggle before Prizes are issued.</h5>\n\n####10. TAXES\na. ALL TAXES IMPOSED ON PRIZES ARE THE SOLE RESPONSIBILITY OF THE WINNERS. Payments to potential winners are subject to the express requirement that they submit all documentation requested by Competition Sponsor or Kaggle for compliance with applicable state, federal, local and foreign (including provincial) tax reporting and withholding requirements. Prizes will be net of any taxes that Competition Sponsor is required by law to withhold. If a potential winner fails to provide any required documentation or comply with applicable laws, the Prize may be forfeited and Competition Sponsor may select an alternative potential winner. Any winners who are U.S. residents will receive an IRS Form-1099 in the amount of their Prize.</h5>\n\n####11. GENERAL CONDITIONS\na. All federal, state, provincial and local laws and regulations apply.</h5>\n\n####12. PUBLICITY\na. You agree that Competition Sponsor, Kaggle and its affiliates may use your name and likeness for advertising and promotional purposes without additional compensation, unless prohibited by law.</h5>\n\n####13. PRIVACY\na. You acknowledge and agree that Competition Sponsor and Kaggle may collect, store, share and otherwise use personally identifiable information provided by you during the Kaggle account registration process and the Competition, including but not limited to, name, mailing address, phone number, and email address (“Personal Information”). Kaggle acts as an independent controller with regard to its collection, storage, sharing, and other use of this Personal Information, and will use this Personal Information in accordance with its Privacy Policy <[www.kaggle.com/privacy][6]>, including for administering the Competition. As a Kaggle.com account holder, you have the right to request access to, review, rectification, portability or deletion of any personal data held by Kaggle about you by logging into your account and/or contacting Kaggle Support at <[www.kaggle.com/contact][7]>.</h5>\nb. As part of Competition Sponsor performing this contract between you and the Competition Sponsor, Kaggle will transfer your Personal Information to Competition Sponsor, which acts as an independent controller with regard to this Personal Information. As a controller of such Personal Information, Competition Sponsor agrees to comply with all U.S. and foreign data protection obligations with regard to your Personal Information. Kaggle will transfer your Personal Information to Competition Sponsor in the country specified in the Competition Sponsor Address listed above, which may be a country outside the country of your residence. Such country may not have privacy laws and regulations similar to those of the country of your residence.</h5>\n\n####14. WARRANTY, INDEMNITY AND RELEASE \na. You warrant that your Submission is your own original work and, as such, you are the sole and exclusive owner and rights holder of the Submission, and you have the right to make the Submission and grant all required licenses.  You agree not to make any Submission that: (i) infringes any third party proprietary rights, intellectual property rights, industrial property rights, personal or moral rights or any other rights, including without limitation, copyright, trademark, patent, trade secret, privacy, publicity or confidentiality obligations, or defames any person; or (ii) otherwise violates any applicable U.S. or foreign state or federal law.</h5>\nb. To the maximum extent permitted by law, you indemnify and agree to keep indemnified Competition Entities at all times from and against any liability, claims, demands, losses, damages, costs and expenses resulting from any of your acts, defaults or omissions and/or a breach of any warranty set forth herein. To the maximum extent permitted by law, you agree to defend, indemnify and hold harmless the Competition Entities from and against any and all claims, actions, suits or proceedings, as well as any and all losses, liabilities, damages, costs and expenses (including reasonable attorneys fees) arising out of or accruing from: (a) your Submission or other material uploaded or otherwise provided by you that infringes any third party proprietary rights, intellectual property rights, industrial property rights, personal or moral rights or any other rights, including without limitation, copyright, trademark, patent, trade secret, privacy, publicity or confidentiality obligations, or defames any person; (b) any misrepresentation made by you in connection with the Competition; (c) any non-compliance by you with these Rules or any applicable U.S. or foreign state or federal law; (d) claims brought by persons or entities other than the parties to these Rules arising from or related to your involvement with the Competition; and (e) your acceptance, possession, misuse or use of any Prize, or your participation in the Competition and any Competition-related activity.</h5>\nc. You hereby release Competition Entities from any liability associated with: (a) any malfunction or other problem with the Competition Website; (b) any error in the collection, processing, or retention of any Submission; or (c) any typographical or other error in the printing, offering or announcement of any Prize or winners.</h5>\n\n####15. INTERNET\na. Competition Entities are not responsible for any malfunction of the Competition Website or any late, lost, damaged, misdirected, incomplete, illegible, undeliverable, or destroyed Submissions or entry materials due to system errors, failed, incomplete or garbled computer or other telecommunication transmission malfunctions, hardware or software failures of any kind, lost or unavailable network connections, typographical or system/human errors and failures, technical malfunction(s) of any telephone network or lines, cable connections, satellite transmissions, servers or providers, or computer equipment, traffic congestion on the Internet or at the Competition Website, or any combination thereof, which may limit a Participant’s ability to participate.</h5>\n\n####16. RIGHT TO CANCEL, MODIFY OR DISQUALIFY\na. If for any reason the Competition is not capable of running as planned, including infection by computer virus, bugs, tampering, unauthorized intervention, fraud, technical failures, or any other causes which corrupt or affect the administration, security, fairness, integrity, or proper conduct of the Competition, Competition Sponsor reserves the right to cancel, terminate, modify or suspend the Competition. Competition Sponsor further reserves the right to disqualify any Participant who tampers with the submission process or any other part of the Competition or Competition Website.  Any attempt by a Participant to deliberately damage any website, including the Competition Website, or undermine the legitimate operation of the Competition is a violation of criminal and civil laws. Should such an attempt be made, Competition Sponsor and Kaggle each reserves the right to seek damages from any such Participant to the fullest extent of the applicable law.</h5>\n\n####17. NOT AN OFFER OR CONTRACT OF EMPLOYMENT\na. Under no circumstances will the entry of a Submission, the awarding of a Prize, or anything in these Rules be construed as an offer or contract of employment with Competition Sponsor or any of the Competition Entities. You acknowledge that you have submitted your Submission voluntarily and not in confidence or in trust. You acknowledge that no confidential, fiduciary, agency, employment or other similar relationship is created between you and Competition Sponsor or any of the Competition Entities by your acceptance of these Rules or your entry of your Submission.</h5>\n\n####18. DEFINITIONS\na. \"Competition Data\" are the data or datasets available from the Competition Website for the purpose of use in the Competition, including any prototype or executable code provided on the Competition Website. The Competition Data will contain private and public test sets. Which data belongs to which set will not be made available to Participants. </h5>\nb. An “Entry” is when a Participant has joined, signed up, or accepted the rules of a competition. Entry is required to make a Submission to a competition.</h5>\nc. A “Final Submission” is the Submission selected by the user, or automatically selected by Kaggle in the event not selected by the user, that is/are used for final placement on the competition leaderboard.</h5>\nd. A “Participant” or “Participant User” is an individual who participates in a competition by entering the competition and making a Submission.</h5>\ne. The “Private Leaderboard” is a ranked display of Participants’ Submission scores against the private test set. The Private Leaderboard determines the final standing in the competition.</h5>\nf. The “Public Leaderboard” is a ranked display of Participants’ Submission scores against a representative sample of the test data. This leaderboard is visible throughout the competition.</h5>\ng. A “Sponsor” is responsible for hosting the competition, which includes but is not limited to providing the data for the competition, determining winners, and enforcing competition rules.</h5>\nh. A “Submission” is anything provided by the Participant to the Sponsor to be evaluated for competition purposes and determine leaderboard position. A Submission may be made as a model, notebook, prediction file, or other format as determined by the Sponsor.</h5>\ni. A “Team” is one or more Participants participating together in a Kaggle competition, by officially merging together as a Team within the competition platform.</h5>\n\n  [1]: https://www.treasury.gov/resource-center/sanctions/Programs/Pages/Programs.aspx\n  [2]: http://www.kaggle.com/terms\n  [3]: http://www.opensource.org\n  [4]: http://www.opensource.org\n  [5]: https://www.kaggle.com/WinningModelDocumentationGuidelines\n  [6]: http://www.kaggle.com/privacy\n  [7]: http://www.kaggle.com/contact\n\n\n\n\n\n\n\n\n",
        "mimeType": "text/markdown",
        "isPublished": true,
        "order": 1,
        "postTitle": "rules",
        "postId": 35381515
      },
      {
        "id": 566003,
        "competitionId": 119106,
        "name": "Description",
        "content": "<img title=”seasons greetings” src=\"https://www.googleapis.com/download/storage/v1/b/kaggle-user-content/o/inbox%2F8939556%2Ff84b88f18d9ee1657b7229ad9fab9713%2FGemini_Generated_Image_kgcl4gkgcl4gkgcl.png?generation=1762216480960277&alt=media\" style=\"float: right; height: 357px\">\n\n_Here comes a challenge, here comes a challenge,_<br>\n_Right to your front door! _ <br>\n_Santa has tree toys, tiny tree toys,_ <br>\n_To mail from shore to shore._ <br>\n_He needs the smallest box, indeed a square box,_<br>\n_To fit them all inside,_<br>\n_So he can mail these stocking stuffers_<br>\n_On his big long Christmas ride!_ <br>\n\n_Here comes the problem, here comes the problem._<br>\n_We need the smallest size!_<br>\n_For one to two hundred trees in shipments,_<br>\n_We need your expert eyes._<br> \n_Can you find the best solution to help us pack_<br> \n_All the tiny trees inside?_<br>\n_We must find the optimal packing to help Santa Claus_<br> \n_And win a prize!_<br>\n\n\n**The Challenge**\n\nIn this re-defined optimization problem, help Santa fit Christmas tree toys into the smallest (2-dimension) parcel size possible so that he can efficiently mail these stocking stuffers around the globe. Santa needs the dimensions of the smallest possible square box that fits shipments of between 1-200 trees. \n\n**The Goal**\n\nFind the optimal packing solution to help Santa this season and win Rudolph's attention by being one of the first to post your solution! \n\nHappy packing!  ",
        "mimeType": "text/markdown",
        "isPublished": true,
        "order": 2,
        "postTitle": "description",
        "postId": 35167555
      },
      {
        "id": 566004,
        "competitionId": 119106,
        "name": "Evaluation",
        "content": "Submissions are evaluated on sum of the normalized area of the square bounding box for each puzzle. For each `n`-tree configuration, the side `s` of square box bounding the trees is squared and divided by the total number `n` of trees in the configuration. The final score is the sum of all configurations. Refer to the [metric notebook](https://www.kaggle.com/code/metric/santa-2025-metric) for exact implementation details.\n\n$$ \\text{score} = \\sum_{n=1}^{N} \\frac{s_{n}^2}{n}$$\n\n## Submission File\nFor each `id` in the submission (representing a single tree in a `n`-tree configuration), you must report the tree position given by `x`, `y`, and the rotation given by `deg`. To avoid loss of precision when saving and reading the files, the values must be converted to a string and prepended with an `s` before submission. Submissions with any overlapping trees will throw an error. To avoid extreme leaderboard scores, location values must be constrained to \\\\(-100 \\le x, y \\le 100\\\\).\n\nThe file should contain a header and have the following format:\n\n    id,x,y,deg\n    001_0,s0.0,s0.0,s20.411299\n    002_0,s0.0,s0.0,s20.411299\n    002_1,s-0.541068,s0.259317,s51.66348\n    etc.",
        "mimeType": "text/markdown",
        "isPublished": true,
        "order": 3,
        "postTitle": "evaluation",
        "postId": 35450563
      },
      {
        "id": 566005,
        "competitionId": 119106,
        "name": "Timeline",
        "content": "* **November 17, 2025** - Start Date.\n\n* **January 23, 2026** - Entry Deadline. You must accept the competition rules before this date in order to compete.\n\n* **January 23, 2026** - Team Merger Deadline. This is the last day participants may join or merge teams.\n\n* **January 30, 2026** - Final Submission Deadline.\n\nAll deadlines are at 11:59 PM UTC on the corresponding day unless otherwise noted. The competition organizers reserve the right to update the contest timeline if they deem it necessary.",
        "mimeType": "text/markdown",
        "isPublished": true,
        "order": 4,
        "postTitle": "timeline",
        "postId": 35381474
      },
      {
        "id": 566006,
        "competitionId": 119106,
        "name": "data-description",
        "content": "The objective of this challenge is to arrange Christmas tree toys into the smallest packing arrangement possible&mdash;as defined by the size of a square bounding box around the trees&mdash;for toy counts of 1-200.\n\n## Files\n\n**sample_submission.csv** - a sample submission in the correct format\n - `id` - a combination of the `n`-tree count for the puzzle and the individual tree index within the puzzle\n - `x`, `y` - the 2-d coordinates of the tree; this point is defined at the center of the top of the trunk\n - `deg` - the rotation angle of the tree\n\n\nThis [Getting Started Notebook](https://www.kaggle.com/code/inversion/santa-2025-getting-started) implements a basic greedy algorithm (which was used to construct the `sample_submission.csv`), demonstrates collision detection, and provides a visualization function.\n\n**Note:** The [metric](https://www.kaggle.com/code/metric/santa-2025-metric) for this competition has been designed to reasonably maximize floating point precision during calculations, but cannot guarantee precision beyond what is displayed on the leaderboard.",
        "mimeType": "text/markdown",
        "isPublished": true,
        "order": 5,
        "postTitle": "",
        "postId": 35450568
      },
      {
        "id": 571004,
        "competitionId": 119106,
        "name": "Prizes",
        "content": "- First Prize: $12,000\n- Second Prize: $10,000\n- Third Prize: $10,000\n- Fourth Prize: $8,000\n\n**Rudolph Prize** - $10,000: Awarded to the team holding 1st place on the leaderboard for the longest period of time between November 17, 2025 12:00 AM UTC and January 30, 2026 11:59 PM UTC. In the event the competition needs to be restarted, the Rudolph Prize dates shall be the new start and deadline of the competition.\n\nAs a condition to being awarded a Prize, a Prize winner must provide a detailed write-up on their solution in the competition forums within 14 days of the conclusion of the competition.\n\n",
        "mimeType": "text/markdown",
        "isPublished": true,
        "order": 6,
        "postTitle": "Prizes",
        "postId": 35381477
      }
    ]
  }
}